/* REXX */                                                                      
"ISREDIT MACRO"                                                                 
                                                                                
"ISREDIT SORT 10 18 19 26 1 9"                                                  
"ISREDIT END"                                                                   
                                                                                
Return                                                                          
