/* REXX */                                                                      
"ISREDIT MACRO"                                                                 
                                                                                
"ISREDIT SORT A 11 20 A 21 30 D 40 51 D 52 62"                                  
"ISREDIT END"                                                                   
                                                                                
Return                                                                          
